/**
 * @param {character[][]} board
 * @return {void} Do not return anything, modify board in-place instead.
 */
var solveSudoku = function(board) {
    /**
     * （i，j）位置能否放置字符c
     */
    function canPut(i,j,c){
        for(let k = 0;k < 9;k++) {
            // 列
            if (board[k][j] === c) return false
            // 行
            if (board[i][k] === c) return false
            // 小单元格
            
        }
    }
};

const board = [
    ['5', '3', '.', '.', '7', '.', '.', '.', '.']
    ['6', '.', '.', '1', '9', '5', '.', '.', '.']
    ['.', '9', '8', '.', '.', '.', '.', '6', '.']
    ['8', '.', '.', '.', '6', '.', '.', '.', '3']
    ['4', '.', '.', '8', '.', '3', '.', '.', '1']
    ['7', '.', '.', '.', '2', '.', '.', '.', '6']
    ['.', '6', '.', '.', '.', '.', '2', '8', '.']
    ['.', '.', '.', '4', '1', '9', '.', '.', '5']
    ['.', '.', '.', '.', '8', '.', '.', '7', '9']
]